---
kind: method
id: M:Autodesk.Revit.DB.TableCellStyleOverrideOptions.#ctor
source: html/b8591b96-160b-2018-8373-71cd552461ff.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.#ctor Method

Creates a new instance with no style characteristics overridden.

## Syntax (C#)
```csharp
public TableCellStyleOverrideOptions()
```